{
  "intents": [
    {
      "tag": "greetings",
      "patterns": ["hello", "hey", "hi", "good day", "greetings", "what's up?"],
      "responses": ["Hello! How can I help you with your health questions today?", "Hi there! Ask me anything about health.", "Hey! What health topic would you like to know about?"]
    },
    {
      "tag": "how_are_you",
      "patterns": ["how are you?", "how is it going?", "what's going on?"],
      "responses": ["I'm doing great! How about you?", "I'm fine, thank you! How can I assist you?"]
    },
    {
      "tag": "goodbye",
      "patterns": ["bye", "goodbye", "see you later", "take care", "quit", "exit"],
      "responses": ["Goodbye! Stay healthy!", "See you later! Take care of your health.", "Bye! Remember to stay hydrated and take breaks!"]
    },
    {
      "tag": "thanks",
      "patterns": ["thank you", "thanks", "thanks a lot", "appreciate it", "much obliged"],
      "responses": ["You're welcome! Stay healthy!", "Happy to help. Let me know if you have more questions.", "Anytime! Wishing you good health."]
    },
    {
      "tag": "healthy_diet",
      "patterns": ["what is a healthy diet?", "tell me about healthy eating", "how to eat healthy?", "what should I eat to stay healthy?"],
      "responses": ["A healthy diet includes fruits, vegetables, whole grains, lean proteins, and plenty of water while limiting processed foods and added sugars.", "Focus on balanced meals with a mix of carbs, proteins, and healthy fats.", "Eating healthy means consuming nutrient-dense foods that support your overall well-being."]
    },
    {
      "tag": "vitamins",
      "patterns": ["why are vitamins important?", "what do vitamins do?", "what vitamins should I take?"],
      "responses": ["Vitamins are essential for various bodily functions, like improving immunity, supporting vision, and boosting energy.", "Vitamin C helps immunity, Vitamin D strengthens bones, and Vitamin A supports eye health."]
    },
    {
      "tag": "protein",
      "patterns": ["how much protein do I need?", "what are good sources of protein?", "why is protein important?"],
      "responses": ["Protein helps build and repair tissues, and it's vital for muscles, skin, and enzymes.", "Good sources of protein include lean meats, fish, eggs, beans, and tofu."]
    },
    {
      "tag": "fiber",
      "patterns": ["why is fiber important?", "what foods are high in fiber?", "how much fiber do I need?"],
      "responses": ["Fiber supports digestion and helps prevent constipation. Foods high in fiber include fruits, vegetables, beans, and whole grains.", "Aim for 25-30 grams of fiber daily for optimal health."]
    },
    {
      "tag": "hydration",
      "patterns": ["how much water should I drink?", "why is hydration important?", "how to stay hydrated?", "benefits of drinking water"],
      "responses": ["Drink at least 8 glasses (about 2 liters) of water daily, or more if you're active.", "Staying hydrated supports digestion, energy levels, and skin health.", "Carry a water bottle with you and aim to drink regularly throughout the day."]
    },
    {
      "tag": "exercise",
      "patterns": ["what exercises are good for health?", "benefits of exercise", "why should I exercise?", "how does exercise help?"],
      "responses": ["Exercise improves cardiovascular health, strengthens muscles, boosts mood, and helps maintain a healthy weight.", "Regular physical activity reduces the risk of chronic diseases like diabetes and heart disease."]
    },
    {
      "tag": "mental_health",
      "patterns": ["how to improve mental health?", "what is mental health?", "how can I reduce stress?", "tips for good mental health"],
      "responses": ["Mental health is about emotional, psychological, and social well-being. It's important for overall health.", "To improve mental health, practice mindfulness, get enough sleep, exercise, and connect with loved ones.", "Managing stress can involve deep breathing, meditation, and maintaining a healthy work-life balance."]
    },
    {
      "tag": "sleep",
      "patterns": ["how much sleep do I need?", "why is sleep important?", "tips for better sleep", "what happens if I don't sleep enough?"],
      "responses": ["Adults need 7-9 hours of sleep per night to maintain optimal health and energy levels.", "Good sleep improves concentration, boosts the immune system, and reduces stress.", "To improve sleep, maintain a regular sleep schedule and limit screen time before bed."]
    },
    {
      "tag": "weight_loss",
      "patterns": ["how to lose weight?", "tips for weight loss", "best diet for weight loss"],
      "responses": ["To lose weight, focus on a calorie deficit by eating healthy foods and staying active.", "Combine regular exercise with a balanced diet rich in fruits, vegetables, and lean proteins."]
    },
    {
      "tag": "immune_system",
      "patterns": ["how to boost immunity?", "how to improve immune health?", "what helps the immune system?"],
      "responses": ["To boost immunity, eat a balanced diet rich in vitamins (C, D, and Zinc), exercise regularly, and get enough sleep.", "Foods like citrus fruits, garlic, and yogurt are great for your immune system."]
    },
    {
      "tag": "heart_health",
      "patterns": ["how to improve heart health?", "what foods are good for the heart?", "how to prevent heart disease?"],
      "responses": ["For heart health, eat foods rich in omega-3s like salmon, reduce salt intake, and stay active.", "Avoid trans fats and focus on whole grains, fruits, and vegetables to keep your heart healthy."]
    },
    {
      "tag": "common_illnesses",
      "patterns": ["how to prevent colds?", "what are the symptoms of the flu?", "how to avoid getting sick?", "what are common illnesses?"],
      "responses": ["To prevent colds and flu, wash your hands regularly, avoid close contact with sick people, and get vaccinated.", "Common symptoms of the flu include fever, chills, muscle aches, fatigue, and a sore throat."]
    },
    {
      "tag": "random_fact",
      "patterns": ["tell me a health fact", "give me a random health fact", "interesting health fact", "fun health fact"],
      "responses": ["Did you know? Drinking enough water can improve your focus and energy levels throughout the day.", "Fun fact: Laughing can boost your immune system and reduce stress.", "Your brain uses about 20% of the calories you consume daily!"]
    }
  ]
}
