{
  "intents": [
    {
      "tag": "greetings",
      "patterns": ["hello", "hey", "hi", "good day", "greetings", "what's up?"],
      "responses": ["Hello! How can I help you with your health questions today?", "Hi there! Ask me anything about health.", "Hey! What health topic would you like to know about?"]
    },
    {
      "tag": "how_are_you",
      "patterns": ["how are you?", "how is it going?"],
      "responses": ["I'm fine, thank you! How can I assist you?", "I'm doing great! How about you?"]
    },
    {
      "tag": "goodbye",
      "patterns": ["bye", "goodbye", "see you later", "take care", "quit", "exit"],
      "responses": ["Goodbye! Stay healthy!", "See you later! Take care of your health.", "Bye! Remember to stay hydrated and take breaks!"]
    },
    {
      "tag": "thanks",
      "patterns": ["thank you", "thanks", "thanks a lot", "appreciate it", "much obliged"],
      "responses": ["You're welcome! Stay healthy!", "Happy to help. Let me know if you have more questions.", "Anytime! Wishing you good health."]
    },
    {
      "tag": "healthy_diet",
      "patterns": ["what is a healthy diet?", "tell me about healthy eating", "how to eat healthy?", "what should I eat to stay healthy?"],
      "responses": ["A healthy diet includes fruits, vegetables, whole grains, lean proteins, and plenty of water while limiting processed foods and added sugars.", "Focus on balanced meals with a mix of carbs, proteins, and healthy fats.", "Eating healthy means consuming nutrient-dense foods that support your overall well-being."]
    },
    {
      "tag": "how_much_exercise",
      "patterns": ["how much should I exercise?", "how much exercise is recommended?", "how often should I work out?"],
      "responses": ["Experts recommend at least 150 minutes of moderate-intensity exercise per week, such as walking or cycling.", "For overall health, aim for at least 30 minutes of physical activity most days of the week."]
    },
    {
      "tag": "exercise",
      "patterns": ["what exercises are good for health?", "benefits of exercise", "why should I exercise?"],
      "responses": ["Exercise improves cardiovascular health, strengthens muscles, boosts mood, and helps maintain a healthy weight.", "Try a mix of aerobic activities like running and strength training for overall fitness."]
    },
    {
      "tag": "mental_health",
      "patterns": ["how to improve mental health?", "what is mental health?", "how can I reduce stress?", "tips for good mental health"],
      "responses": ["Mental health is about emotional, psychological, and social well-being. It's important for overall health.", "To improve mental health, practice mindfulness, get enough sleep, exercise, and connect with loved ones.", "Managing stress can involve deep breathing, meditation, and maintaining a healthy work-life balance."]
    },
    {
      "tag": "hydration",
      "patterns": ["how much water should I drink?", "why is hydration important?", "how to stay hydrated?", "benefits of drinking water"],
      "responses": ["Drink at least 8 glasses (about 2 liters) of water daily, or more if you're active.", "Staying hydrated supports digestion, energy levels, and skin health.", "Carry a water bottle with you and aim to drink regularly throughout the day."]
    },
    {
      "tag": "sleep",
      "patterns": ["how much sleep do I need?", "why is sleep important?", "tips for better sleep", "what happens if I don't sleep enough?"],
      "responses": ["Adults need 7-9 hours of sleep per night to maintain optimal health and energy levels.", "Good sleep improves concentration, boosts the immune system, and reduces stress.", "To improve sleep, maintain a regular sleep schedule and limit screen time before bed."]
    },
    {
      "tag": "common_illnesses",
      "patterns": ["how to prevent colds?", "what are the symptoms of the flu?", "how to boost immunity?", "how to avoid getting sick?"],
      "responses": ["To prevent colds and flu, wash your hands regularly, avoid close contact with sick people, and get vaccinated.", "Boost immunity by eating healthy, staying active, and getting enough sleep.", "Symptoms of the flu include fever, chills, muscle aches, fatigue, and a sore throat."]
    },
    {
      "tag": "nutrition",
      "patterns": ["what are essential nutrients?", "why are vitamins important?", "what should I eat for energy?", "how to get enough protein?"],
      "responses": ["Essential nutrients include carbohydrates, proteins, fats, vitamins, minerals, and water.", "Vitamins like A, C, and D are crucial for immunity, skin health, and overall well-being.", "For energy, focus on whole foods like fruits, vegetables, nuts, and lean proteins."]
    },
    {
      "tag": "random_fact",
      "patterns": ["tell me a health fact", "give me a random health fact", "interesting health fact", "fun health fact"],
      "responses": ["Did you know? Drinking enough water can improve your focus and energy levels throughout the day.", "Fun fact: Laughing can boost your immune system and reduce stress.", "Your brain uses about 20% of the calories you consume daily!"]
    }
  ]
}